# Pandas Assignment 3 (A)



### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as nb
import math

### Step 2. Import the dataset

In [3]:
df = pd.read_excel('Pandas Assignment 2A.xlsx')

### Step 3. Assign it to a variable called baby_names.

In [4]:
baby_names = df

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
del baby_names['Id']

In [7]:
del baby_names['Unnamed: 0']

In [8]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [9]:
baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [33]:
names = baby_names.groupby('Name').sum()
#print(names.shape)
print(names)

         Unnamed: 0         Id    Year  \
Name
True       66108018   66108045   54274
Aaban       7733801    7733803    4027
Aadan       7158061    7158065    8039
Aadarsh     1728030    1728031    2009
Aaden     555052029  555052225  393963
...             ...        ...     ...
Zyra       17538998   17539005   14085
Zyrah       5487073    5487075    4024
Zyren       5074229    5074230    2013
Zyria      29787029   29787039   20089
Zyriah     34146196   34146205   18087

                                                    Gender  \
Name
True                           FFFFFFMMMMMMMMFFFFFFMMMMMMM
Aaban                                                   MM
Aadan                                                 MMMM
Aadarsh                                                  M
Aaden    MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM...
...                                                    ...
Zyra                                               FFFFFFF
Zyrah                                                   FF
Zyren                                                    M
Zyria                                           FFFFFFFFFF
Zyriah                                           FFFFFFFFF

                                                     State  Count
Name
True     CACACACACACACACACACACACACACAGAMDOHPATXTXTXTXTX...    157
Aaban                                                 NYNY     12
Aadan                                             CACACATX     23
Aadarsh                                                 IL      5
Aaden    ALALALALALALALARARARAZAZAZAZAZAZCACACACACACACA...   3426
...                                                    ...    ...
Zyra                                        CACACAFLTXTXTX     42
Zyrah                                                 CATX     11
Zyren                                                   TX      6
Zyria                                 GAGAGALALALATXTXTXTX     59
Zyriah                                  GAGALATXTXTXTXTXTX     58

[17632 rows x 6 columns]

### Step 8. How many different names exist in the dataset?

In [116]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [12]:
names.Count.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [27]:
len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [29]:
names[names.Count == names.Count.median()]

         Unnamed: 0        Id   Year    Gender             State  Count
Name
Aishani     7810519   7810526  14078   FFFFFFF    CACACACACAILNJ     49
Alara      18841019  18841027  16079  FFFFFFFF  CACACAFLNYNYNYTX     49
Alysse     22629397  22629405  16057  FFFFFFFF  CACACAMINYTXTXTX     49
Ameir      21780403  21780411  16086  MMMMMMMM  CAMIMIMIMIMINYOH     49
Anely       4349533   4349541  16071  FFFFFFFF  CACACACACACACACA     49
...             ...       ...    ...       ...               ...    ...
Sriram      9208196   9208203  14054   MMMMMMM    CACACACACACATX     49
Trinton    32822294  32822302  16069  MMMMMMMM  FLLAOKTXTXTXTXTX     49
Vita       10241625  10241632  14075   FFFFFFF    CACACACACANYNY     49
Yoni        6439146   6439154  16060  MMMMMMMM  CACACACACACAFLFL     49
Zuleima     3521366   3521373  14050   FFFFFFF    AZCACACACACACA     49

[66 rows x 6 columns]

### Step 12. What is the standard deviation of names?

In [30]:
names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [42]:
names.describe()

         Unnamed: 0            Id          Year          Count
count  1.763200e+04  1.763200e+04  1.763200e+04   17632.000000
mean   1.631922e+08  1.631922e+08  1.158117e+05    2008.932169
std    3.504512e+08  3.504513e+08  2.451618e+05   11006.069468
min    8.606400e+04  8.606500e+04  2.004000e+03       5.000000
25%    4.918374e+06  4.918375e+06  4.017000e+03      11.000000
50%    1.963462e+07  1.963463e+07  1.606100e+04      49.000000
75%    1.071826e+08  1.071826e+08  7.846425e+04     337.000000
max    3.223035e+09  3.223036e+09  2.233993e+06  242874.000000